const animalData = {
  animals: [
    {
      id: 1,
      name: '개',
      kinds: [
        {
          id: 39,
          name: '골든 리트리버'
        },
        {
          id: 40,
          name: '그레이 하운드'
        },
        {
          id: 41,
          name: '그레이트 덴'
        },
        {
          id: 42,
          name: '그레이트 피레니즈'
        },
        {
          id: 43,
          name: '기타'
        },
        {
          id: 44,
          name: '꼬똥 드 뚤레아'
        },
        {
          id: 45,
          name: '네오폴리탄 마스티프'
        },
        {
          id: 46,
          name: '노르포크 테리어'
        },
        {
          id: 47,
          name: '노리치 테리어'
        },
        {
          id: 48,
          name: '뉴펀들랜드'
        },
        {
          id: 49,
          name: '닥스훈트'
        },
        {
          id: 50,
          name: '달마시안'
        },
        {
          id: 51,
          name: '댄디 딘몬트 테리어'
        },
        {
          id: 52,
          name: '도고 까니리오'
        },
        {
          id: 53,
          name: '도고 아르젠티노'
        },
        {
          id: 54,
          name: '도고 아르젠티노'
        },
        {
          id: 55,
          name: '도베르만'
        },
        {
          id: 56,
          name: '도사'
        },
        {
          id: 57,
          name: '동경견'
        },
        {
          id: 58,
          name: '라브라도 리트리버'
        },
        {
          id: 59,
          name: '라사 압소'
        },
        {
          id: 60,
          name: '라이카'
        },
        {
          id: 61,
          name: '래빗 닥스훈드'
        },
        {
          id: 62,
          name: '랫 테리어'
        },
        {
          id: 63,
          name: '레이크랜드 테리어'
        },
        {
          id: 64,
          name: '로디지안 리즈백 '
        },
        {
          id: 65,
          name: '로트와일러'
        },
        {
          id: 66,
          name: '로트와일러'
        },
        {
          id: 67,
          name: '마리노이즈'
        },
        {
          id: 68,
          name: '마스티프'
        },
        {
          id: 69,
          name: '말라뮤트'
        },
        {
          id: 70,
          name: '말티즈'
        },
        {
          id: 71,
          name: '맨체스터테리어'
        },
        {
          id: 72,
          name: '미니어쳐 닥스훈트'
        },
        {
          id: 73,
          name: '미니어쳐 불 테리어'
        },
        {
          id: 74,
          name: '미니어쳐 슈나우저'
        },
        {
          id: 75,
          name: '미니어쳐 푸들'
        },
        {
          id: 76,
          name: '미니어쳐 핀셔'
        },
        {
          id: 77,
          name: '미디엄 푸들'
        },
        {
          id: 78,
          name: '미텔 스피츠'
        },
        {
          id: 79,
          name: '믹스견'
        },
        {
          id: 80,
          name: '바센지'
        },
        {
          id: 81,
          name: '바셋 하운드'
        },
        {
          id: 82,
          name: '버니즈 마운틴 독'
        },
        {
          id: 83,
          name: '베들링턴 테리어'
        },
        {
          id: 84,
          name: '벨기에 그로넨달'
        },
        {
          id: 85,
          name: '벨기에 쉽독'
        },
        {
          id: 86,
          name: '벨기에 테뷰런'
        },
        {
          id: 87,
          name: '벨지안 셰퍼드 독'
        },
        {
          id: 88,
          name: '보더 콜리'
        },
        {
          id: 89,
          name: '보르조이'
        },
        {
          id: 90,
          name: '보스턴 테리어'
        },
        {
          id: 91,
          name: '복서'
        },
        {
          id: 92,
          name: '볼로네즈'
        },
        {
          id: 93,
          name: '부비에 데 플랑드르'
        },
        {
          id: 94,
          name: '불 테리어'
        },
        {
          id: 95,
          name: '불독'
        },
        {
          id: 96,
          name: '브뤼셀그리펀'
        },
        {
          id: 97,
          name: '브리타니 스파니엘'
        },
        {
          id: 98,
          name: '블랙 테리어'
        },
        {
          id: 99,
          name: '비글'
        },
        {
          id: 100,
          name: '비숑 프리제'
        },
        {
          id: 101,
          name: '비어디드 콜리'
        },
        {
          id: 102,
          name: '비즐라'
        },
        {
          id: 103,
          name: '빠삐용'
        },
        {
          id: 104,
          name: '사모예드'
        },
        {
          id: 105,
          name: '살루키'
        },
        {
          id: 106,
          name: '삽살개'
        },
        {
          id: 107,
          name: '샤페이'
        },
        {
          id: 108,
          name: '세인트 버나드'
        },
        {
          id: 109,
          name: '센트럴 아시안 오브차카'
        },
        {
          id: 110,
          name: '셔틀랜드 쉽독'
        },
        {
          id: 111,
          name: '셰퍼드'
        },
        {
          id: 112,
          name: '슈나우져'
        },
        {
          id: 113,
          name: '스코티쉬 테리어'
        },
        {
          id: 114,
          name: '스코티시 디어하운드'
        },
        {
          id: 115,
          name: '스태퍼드셔 불 테리어'
        },
        {
          id: 116,
          name: '스탠다드 푸들'
        },
        {
          id: 117,
          name: '스피츠'
        },
        {
          id: 118,
          name: '시바'
        },
        {
          id: 119,
          name: '시베리안 허스키'
        },
        {
          id: 120,
          name: '시베리안라이카'
        },
        {
          id: 121,
          name: '시잉프랑세즈'
        },
        {
          id: 122,
          name: '시츄'
        },
        {
          id: 123,
          name: '시코쿠'
        },
        {
          id: 124,
          name: '실리햄 테리어'
        },
        {
          id: 125,
          name: '실키테리어'
        },
        {
          id: 126,
          name: '아나톨리안 셰퍼드'
        },
        {
          id: 127,
          name: '아메리칸 불독'
        },
        {
          id: 128,
          name: '아메리칸 스태퍼드셔 테리어'
        },
        {
          id: 129,
          name: '아메리칸 아키다'
        },
        {
          id: 130,
          name: '아메리칸 에스키모'
        },
        {
          id: 131,
          name: '아메리칸 코카 스파니엘'
        },
        {
          id: 132,
          name: '아메리칸 핏불 테리어'
        },
        {
          id: 133,
          name: '아메리칸불리'
        },
        {
          id: 134,
          name: '아이리쉬 레드 앤 화이트 세터'
        },
        {
          id: 135,
          name: '아이리쉬 세터'
        },
        {
          id: 136,
          name: '아이리쉬 울프 하운드'
        },
        {
          id: 137,
          name: '아이리쉬소프트코튼휘튼테리어'
        },
        {
          id: 138,
          name: '아키다'
        },
        {
          id: 139,
          name: '아프간 하운드'
        },
        {
          id: 140,
          name: '알라스칸 말라뮤트'
        },
        {
          id: 141,
          name: '에어델 테리어'
        },
        {
          id: 142,
          name: '오브차카'
        },
        {
          id: 143,
          name: '오스트랄리안 셰퍼드 독'
        },
        {
          id: 144,
          name: '오스트랄리안 캐틀 독'
        },
        {
          id: 145,
          name: '올드 잉글리쉬 불독'
        },
        {
          id: 146,
          name: '올드 잉글리쉬 쉽독'
        },
        {
          id: 147,
          name: '와이마라너'
        },
        {
          id: 148,
          name: '와이어 폭스 테리어'
        },
        {
          id: 149,
          name: '요크셔 테리어'
        },
        {
          id: 150,
          name: '울프독'
        },
        {
          id: 151,
          name: '웨스트 시베리언 라이카'
        },
        {
          id: 152,
          name: '웨스트하이랜드화이트테리어'
        },
        {
          id: 153,
          name: '웰시 코기 카디건'
        },
        {
          id: 154,
          name: '웰시 코기 펨브로크'
        },
        {
          id: 155,
          name: '웰시 테리어'
        },
        {
          id: 156,
          name: '이탈리안 그레이 하운드'
        },
        {
          id: 157,
          name: '잉글리쉬 세터'
        },
        {
          id: 158,
          name: '잉글리쉬 스프링거 스파니엘'
        },
        {
          id: 159,
          name: '잉글리쉬 코카 스파니엘'
        },
        {
          id: 160,
          name: '잉글리쉬 포인터'
        },
        {
          id: 161,
          name: '자이언트 슈나우져'
        },
        {
          id: 162,
          name: '재패니즈 스피츠'
        },
        {
          id: 163,
          name: '잭 러셀 테리어'
        },
        {
          id: 164,
          name: '저먼 셰퍼드 독'
        },
        {
          id: 165,
          name: '저먼 와이어헤어드 포인터'
        },
        {
          id: 166,
          name: '저먼 포인터'
        },
        {
          id: 167,
          name: '저먼 헌팅 테리어'
        },
        {
          id: 168,
          name: '제주개'
        },
        {
          id: 169,
          name: '제페니즈칭'
        },
        {
          id: 170,
          name: '진도견'
        },
        {
          id: 171,
          name: '차우차우'
        },
        {
          id: 172,
          name: '차이니즈 크레스티드 독'
        },
        {
          id: 173,
          name: '치와와'
        },
        {
          id: 174,
          name: '카레리안 베어독'
        },
        {
          id: 175,
          name: '카이훗'
        },
        {
          id: 176,
          name: '캐벌리어 킹 찰스 스파니엘'
        },
        {
          id: 177,
          name: '케니스펜더'
        },
        {
          id: 178,
          name: '케리 블루 테리어'
        },
        {
          id: 179,
          name: '케언 테리어'
        },
        {
          id: 180,
          name: '케인 코르소'
        },
        {
          id: 181,
          name: '코리아 트라이 하운드'
        },
        {
          id: 182,
          name: '코리안 마스티프'
        },
        {
          id: 183,
          name: '코카 스파니엘'
        },
        {
          id: 184,
          name: '코카 푸'
        },
        {
          id: 185,
          name: '코카시안오브차카'
        },
        {
          id: 186,
          name: '콜리'
        },
        {
          id: 187,
          name: '클라인스피츠'
        },
        {
          id: 188,
          name: '키슈'
        },
        {
          id: 189,
          name: '키스 훈드'
        },
        {
          id: 190,
          name: '토이 맨체스터 테리어'
        },
        {
          id: 191,
          name: '토이 푸들'
        },
        {
          id: 192,
          name: '티베탄 마스티프'
        },
        {
          id: 193,
          name: '파라오 하운드'
        },
        {
          id: 194,
          name: '파슨 러셀 테리어'
        },
        {
          id: 195,
          name: '팔렌'
        },
        {
          id: 196,
          name: '퍼그'
        },
        {
          id: 197,
          name: '페키니즈'
        },
        {
          id: 198,
          name: '페터데일테리어'
        },
        {
          id: 199,
          name: '포메라니안'
        },
        {
          id: 200,
          name: '포인터'
        },
        {
          id: 201,
          name: '폭스테리어'
        },
        {
          id: 202,
          name: '푸들'
        },
        {
          id: 203,
          name: '풀리'
        },
        {
          id: 204,
          name: '풍산견'
        },
        {
          id: 205,
          name: '프레사까나리오'
        },
        {
          id: 206,
          name: '프렌치 불독'
        },
        {
          id: 207,
          name: '프렌치 브리타니'
        },
        {
          id: 208,
          name: '플랫 코티드 리트리버'
        },
        {
          id: 209,
          name: '플롯하운드'
        },
        {
          id: 210,
          name: '피레니안 마운틴 독'
        },
        {
          id: 211,
          name: '필라 브라질레이로'
        },
        {
          id: 212,
          name: '핏불테리어'
        },
        {
          id: 213,
          name: '허배너스'
        },
        {
          id: 214,
          name: '화이트리트리버'
        },
        {
          id: 215,
          name: '화이트테리어'
        },
        {
          id: 216,
          name: '휘펫'
        },
        {
          id: 258,
          name: '웰시코기'
        },
        {
          id: 259,
          name: '그레이트 피트니스'
        },
        {
          id: 263,
          name: '멍멍'
        }
      ]
    },
    {
      id: 2,
      name: '고양이',
      kinds: [
        {
          id: 1,
          name: '고양이'
        },
        {
          id: 2,
          name: '기타'
        },
        {
          id: 3,
          name: '노르웨이 숲'
        },
        {
          id: 4,
          name: '데본 렉스'
        },
        {
          id: 5,
          name: '러시안 블루'
        },
        {
          id: 6,
          name: '레그돌'
        },
        {
          id: 7,
          name: '레그돌-라가머핀'
        },
        {
          id: 8,
          name: '맹크스'
        },
        {
          id: 9,
          name: '먼치킨'
        },
        {
          id: 10,
          name: '메인쿤'
        },
        {
          id: 11,
          name: '믹스묘'
        },
        {
          id: 12,
          name: '발리네즈'
        },
        {
          id: 13,
          name: '버만'
        },
        {
          id: 14,
          name: '벵갈'
        },
        {
          id: 15,
          name: '봄베이'
        },
        {
          id: 16,
          name: '브리티쉬롱헤어'
        },
        {
          id: 17,
          name: '브리티시 쇼트헤어'
        },
        {
          id: 18,
          name: '사바나캣'
        },
        {
          id: 19,
          name: '샤트룩스'
        },
        {
          id: 20,
          name: '샴'
        },
        {
          id: 21,
          name: '셀커크 렉스'
        },
        {
          id: 22,
          name: '소말리'
        },
        {
          id: 23,
          name: '스노우 슈'
        },
        {
          id: 24,
          name: '스코티시폴드'
        },
        {
          id: 25,
          name: '스핑크스'
        },
        {
          id: 26,
          name: '시베리안 포레스트'
        },
        {
          id: 27,
          name: '싱가퓨라'
        },
        {
          id: 28,
          name: '아메리칸 쇼트헤어'
        },
        {
          id: 29,
          name: '아비시니안'
        },
        {
          id: 30,
          name: '재패니즈밥테일'
        },
        {
          id: 31,
          name: '터키시 앙고라'
        },
        {
          id: 32,
          name: '통키니즈'
        },
        {
          id: 33,
          name: '페르시안'
        },
        {
          id: 34,
          name: '페르시안-페르시안 친칠라'
        },
        {
          id: 35,
          name: '하바나 브라운'
        },
        {
          id: 36,
          name: '하일랜드 폴드'
        },
        {
          id: 37,
          name: '한국 고양이'
        },
        {
          id: 257,
          name: 'UNKNOWN'
        }
      ]
    },
    {
      id: 3,
      name: '기타',
      kinds: [
        {
          id: 38,
          name: '기타축종'
        },
        {
          id: 217,
          name: '오리'
        },
        {
          id: 218,
          name: '토끼'
        },
        {
          id: 219,
          name: '폼피츠'
        },
        {
          id: 220,
          name: '모름'
        },
        {
          id: 221,
          name: '발바리'
        },
        {
          id: 222,
          name: '폼피츠믹스'
        },
        {
          id: 223,
          name: '혼합'
        },
        {
          id: 224,
          name: '금계'
        },
        {
          id: 225,
          name: '앵무새'
        },
        {
          id: 226,
          name: '블루틱쿤하운드'
        },
        {
          id: 227,
          name: '미니핀믹스'
        },
        {
          id: 228,
          name: '말티푸'
        },
        {
          id: 229,
          name: '햄스터'
        },
        {
          id: 230,
          name: '흑염소'
        },
        {
          id: 231,
          name: '호피믹스'
        },
        {
          id: 232,
          name: '진도견믹스'
        },
        {
          id: 233,
          name: '진도견 믹스'
        },
        {
          id: 234,
          name: '고슴도치'
        },
        {
          id: 235,
          name: '기러기'
        },
        {
          id: 236,
          name: '닭'
        },
        {
          id: 237,
          name: '엑죠틱'
        },
        {
          id: 256,
          name: '거북이'
        },
        {
          id: 260,
          name: '거미'
        },
        {
          id: 264,
          name: '늑대거북'
        },
        {
          id: 265,
          name: '황조롱이'
        },
        {
          id: 271,
          name: 'UNKNOWN'
        },
        {
          id: 272,
          name: '염소'
        },
        {
          id: 273,
          name: '믹스'
        },
        {
          id: 274,
          name: '백봉오골계'
        }
      ]
    }
  ]
};

const placeData = {
  cities: [
    {
      id: 1,
      name: '서울특별시',
      towns: [
        {
          id: 2,
          name: '강남구'
        },
        {
          id: 3,
          name: '강동구'
        },
        {
          id: 4,
          name: '강북구'
        },
        {
          id: 5,
          name: '강서구'
        },
        {
          id: 6,
          name: '관악구'
        },
        {
          id: 7,
          name: '광진구'
        },
        {
          id: 8,
          name: '구로구'
        },
        {
          id: 9,
          name: '금천구'
        },
        {
          id: 10,
          name: '노원구'
        },
        {
          id: 11,
          name: '도봉구'
        },
        {
          id: 12,
          name: '동대문구'
        },
        {
          id: 13,
          name: '동작구'
        },
        {
          id: 14,
          name: '마포구'
        },
        {
          id: 15,
          name: '서대문구'
        },
        {
          id: 16,
          name: '서울특별시'
        },
        {
          id: 17,
          name: '서초구'
        },
        {
          id: 18,
          name: '성동구'
        },
        {
          id: 19,
          name: '성북구'
        },
        {
          id: 20,
          name: '송파구'
        },
        {
          id: 21,
          name: '양천구'
        },
        {
          id: 22,
          name: '영등포구'
        },
        {
          id: 23,
          name: '용산구'
        },
        {
          id: 24,
          name: '은평구'
        },
        {
          id: 25,
          name: '종로구'
        },
        {
          id: 26,
          name: '중구'
        },
        {
          id: 27,
          name: '중랑구'
        }
      ]
    },
    {
      id: 2,
      name: '부산광역시',
      towns: [
        {
          id: 123,
          name: '강서구'
        },
        {
          id: 124,
          name: '금정구'
        },
        {
          id: 125,
          name: '기장군'
        },
        {
          id: 126,
          name: '남구'
        },
        {
          id: 127,
          name: '동구'
        },
        {
          id: 128,
          name: '동래구'
        },
        {
          id: 129,
          name: '부산진구'
        },
        {
          id: 130,
          name: '북구'
        },
        {
          id: 131,
          name: '사상구'
        },
        {
          id: 132,
          name: '사하구'
        },
        {
          id: 133,
          name: '서구'
        },
        {
          id: 134,
          name: '수영구'
        },
        {
          id: 135,
          name: '연제구'
        },
        {
          id: 136,
          name: '영도구'
        },
        {
          id: 137,
          name: '중구'
        },
        {
          id: 138,
          name: '해운대구'
        }
      ]
    },
    {
      id: 3,
      name: '대구광역시',
      towns: [
        {
          id: 228,
          name: '남구'
        },
        {
          id: 229,
          name: '달서구'
        },
        {
          id: 230,
          name: '달성군'
        },
        {
          id: 231,
          name: '동구'
        },
        {
          id: 232,
          name: '북구'
        },
        {
          id: 233,
          name: '서구'
        },
        {
          id: 234,
          name: '수성구'
        },
        {
          id: 235,
          name: '중구'
        }
      ]
    },
    {
      id: 4,
      name: '인천광역시',
      towns: [
        {
          id: 158,
          name: '강화군'
        },
        {
          id: 159,
          name: '계양구'
        },
        {
          id: 160,
          name: '남동구'
        },
        {
          id: 161,
          name: '동구'
        },
        {
          id: 162,
          name: '미추홀구'
        },
        {
          id: 163,
          name: '부평구'
        },
        {
          id: 164,
          name: '서구'
        },
        {
          id: 165,
          name: '연수구'
        },
        {
          id: 166,
          name: '옹진군'
        },
        {
          id: 167,
          name: '중구'
        }
      ]
    },
    {
      id: 5,
      name: '광주광역시',
      towns: [
        {
          id: 28,
          name: '광산구'
        },
        {
          id: 29,
          name: '남구'
        },
        {
          id: 30,
          name: '동구'
        },
        {
          id: 31,
          name: '북구'
        },
        {
          id: 32,
          name: '서구'
        }
      ]
    },
    {
      id: 6,
      name: '대전광역시',
      towns: [
        {
          id: 33,
          name: '대덕구'
        },
        {
          id: 34,
          name: '동구'
        },
        {
          id: 35,
          name: '서구'
        },
        {
          id: 36,
          name: '유성구'
        },
        {
          id: 37,
          name: '중구'
        }
      ]
    },
    {
      id: 7,
      name: '울산광역시',
      towns: [
        {
          id: 191,
          name: '남구'
        },
        {
          id: 192,
          name: '동구'
        },
        {
          id: 193,
          name: '북구'
        },
        {
          id: 194,
          name: '울주군'
        },
        {
          id: 195,
          name: '중구'
        }
      ]
    },
    {
      id: 8,
      name: '세종특별자치시',
      towns: [
        {
          id: 236,
          name: '세종특별자치시'
        },
        {
          id: 238,
          name: '전체'
        }
      ]
    },
    {
      id: 9,
      name: '경기도',
      towns: [
        {
          id: 91,
          name: '가평군'
        },
        {
          id: 92,
          name: '고양시'
        },
        {
          id: 93,
          name: '과천시'
        },
        {
          id: 94,
          name: '광명시'
        },
        {
          id: 95,
          name: '광주시'
        },
        {
          id: 96,
          name: '구리시'
        },
        {
          id: 97,
          name: '군포시'
        },
        {
          id: 98,
          name: '김포시'
        },
        {
          id: 99,
          name: '남양주시'
        },
        {
          id: 100,
          name: '동두천시'
        },
        {
          id: 101,
          name: '부천시'
        },
        {
          id: 102,
          name: '성남시'
        },
        {
          id: 103,
          name: '수원시'
        },
        {
          id: 104,
          name: '시흥시'
        },
        {
          id: 105,
          name: '안산시'
        },
        {
          id: 106,
          name: '안성시'
        },
        {
          id: 107,
          name: '안양시'
        },
        {
          id: 108,
          name: '양주시'
        },
        {
          id: 109,
          name: '양평군'
        },
        {
          id: 110,
          name: '여주시'
        },
        {
          id: 111,
          name: '연천군'
        },
        {
          id: 112,
          name: '오산시'
        },
        {
          id: 113,
          name: '용인시'
        },
        {
          id: 114,
          name: '용인시 기흥구'
        },
        {
          id: 115,
          name: '의왕시'
        },
        {
          id: 116,
          name: '의정부시'
        },
        {
          id: 117,
          name: '이천시'
        },
        {
          id: 118,
          name: '파주시'
        },
        {
          id: 119,
          name: '평택시'
        },
        {
          id: 120,
          name: '포천시'
        },
        {
          id: 121,
          name: '하남시'
        },
        {
          id: 122,
          name: '화성시'
        }
      ]
    },
    {
      id: 10,
      name: '강원도',
      towns: [
        {
          id: 196,
          name: '강릉시'
        },
        {
          id: 197,
          name: '고성군'
        },
        {
          id: 198,
          name: '동해시'
        },
        {
          id: 199,
          name: '삼척시'
        },
        {
          id: 200,
          name: '속초시'
        },
        {
          id: 201,
          name: '양구군'
        },
        {
          id: 202,
          name: '양양군'
        },
        {
          id: 203,
          name: '영월군'
        },
        {
          id: 204,
          name: '원주시'
        },
        {
          id: 205,
          name: '인제군'
        },
        {
          id: 206,
          name: '정선군'
        },
        {
          id: 207,
          name: '철원군'
        },
        {
          id: 208,
          name: '춘천시'
        },
        {
          id: 209,
          name: '태백시'
        },
        {
          id: 210,
          name: '평창군'
        },
        {
          id: 211,
          name: '홍천군'
        },
        {
          id: 212,
          name: '화천군'
        },
        {
          id: 213,
          name: '횡성군'
        }
      ]
    },
    {
      id: 11,
      name: '충청북도',
      towns: [
        {
          id: 58,
          name: '괴산군'
        },
        {
          id: 59,
          name: '단양군'
        },
        {
          id: 60,
          name: '보은군'
        },
        {
          id: 61,
          name: '영동군'
        },
        {
          id: 62,
          name: '옥천군'
        },
        {
          id: 63,
          name: '음성군'
        },
        {
          id: 64,
          name: '제천시'
        },
        {
          id: 65,
          name: '증평군'
        },
        {
          id: 66,
          name: '진천군'
        },
        {
          id: 67,
          name: '청주시'
        },
        {
          id: 68,
          name: '충주시'
        }
      ]
    },
    {
      id: 12,
      name: '충청남도',
      towns: [
        {
          id: 139,
          name: '계룡시'
        },
        {
          id: 140,
          name: '공주시'
        },
        {
          id: 141,
          name: '금산군'
        },
        {
          id: 142,
          name: '논산시'
        },
        {
          id: 143,
          name: '당진시'
        },
        {
          id: 144,
          name: '보령시'
        },
        {
          id: 145,
          name: '부여군'
        },
        {
          id: 146,
          name: '서산시'
        },
        {
          id: 147,
          name: '서천군'
        },
        {
          id: 148,
          name: '아산시'
        },
        {
          id: 149,
          name: '연기군'
        },
        {
          id: 150,
          name: '예산군'
        },
        {
          id: 151,
          name: '천안시'
        },
        {
          id: 152,
          name: '청양군'
        },
        {
          id: 153,
          name: '태안군'
        },
        {
          id: 154,
          name: '홍성군'
        }
      ]
    },
    {
      id: 13,
      name: '전라북도',
      towns: [
        {
          id: 214,
          name: '고창군'
        },
        {
          id: 215,
          name: '군산시'
        },
        {
          id: 216,
          name: '김제시'
        },
        {
          id: 217,
          name: '남원시'
        },
        {
          id: 218,
          name: '무주군'
        },
        {
          id: 219,
          name: '부안군'
        },
        {
          id: 220,
          name: '순창군'
        },
        {
          id: 221,
          name: '완주군'
        },
        {
          id: 222,
          name: '익산시'
        },
        {
          id: 223,
          name: '임실군'
        },
        {
          id: 224,
          name: '장수군'
        },
        {
          id: 225,
          name: '전주시'
        },
        {
          id: 226,
          name: '정읍시'
        },
        {
          id: 227,
          name: '진안군'
        }
      ]
    },
    {
      id: 14,
      name: '전라남도',
      towns: [
        {
          id: 69,
          name: '강진군'
        },
        {
          id: 70,
          name: '고흥군'
        },
        {
          id: 71,
          name: '곡성군'
        },
        {
          id: 72,
          name: '광양시'
        },
        {
          id: 73,
          name: '구례군'
        },
        {
          id: 74,
          name: '나주시'
        },
        {
          id: 75,
          name: '담양군'
        },
        {
          id: 76,
          name: '목포시'
        },
        {
          id: 77,
          name: '무안군'
        },
        {
          id: 78,
          name: '보성군'
        },
        {
          id: 79,
          name: '순천시'
        },
        {
          id: 80,
          name: '신안군'
        },
        {
          id: 81,
          name: '여수시'
        },
        {
          id: 82,
          name: '영광군'
        },
        {
          id: 83,
          name: '영암군'
        },
        {
          id: 84,
          name: '완도군'
        },
        {
          id: 85,
          name: '장성군'
        },
        {
          id: 86,
          name: '장흥군'
        },
        {
          id: 87,
          name: '진도군'
        },
        {
          id: 88,
          name: '함평군'
        },
        {
          id: 89,
          name: '해남군'
        },
        {
          id: 90,
          name: '화순군'
        }
      ]
    },
    {
      id: 15,
      name: '경상북도',
      towns: [
        {
          id: 168,
          name: '경산시'
        },
        {
          id: 169,
          name: '경주시'
        },
        {
          id: 170,
          name: '고령군'
        },
        {
          id: 171,
          name: '구미시'
        },
        {
          id: 172,
          name: '군위군'
        },
        {
          id: 173,
          name: '김천시'
        },
        {
          id: 174,
          name: '문경시'
        },
        {
          id: 175,
          name: '봉화군'
        },
        {
          id: 176,
          name: '상주시'
        },
        {
          id: 177,
          name: '성주군'
        },
        {
          id: 178,
          name: '안동시'
        },
        {
          id: 179,
          name: '영덕군'
        },
        {
          id: 180,
          name: '영양군'
        },
        {
          id: 181,
          name: '영주시'
        },
        {
          id: 182,
          name: '영천시'
        },
        {
          id: 183,
          name: '예천군'
        },
        {
          id: 184,
          name: '울릉군'
        },
        {
          id: 185,
          name: '울진군'
        },
        {
          id: 186,
          name: '의성군'
        },
        {
          id: 187,
          name: '청도군'
        },
        {
          id: 188,
          name: '청송군'
        },
        {
          id: 189,
          name: '칠곡군'
        },
        {
          id: 190,
          name: '포항시'
        }
      ]
    },
    {
      id: 16,
      name: '경상남도',
      towns: [
        {
          id: 38,
          name: '거제시'
        },
        {
          id: 39,
          name: '거창군'
        },
        {
          id: 40,
          name: '고성군'
        },
        {
          id: 41,
          name: '김해시'
        },
        {
          id: 42,
          name: '남해군'
        },
        {
          id: 43,
          name: '밀양시'
        },
        {
          id: 44,
          name: '사천시'
        },
        {
          id: 45,
          name: '산청군'
        },
        {
          id: 46,
          name: '양산시'
        },
        {
          id: 47,
          name: '의령군'
        },
        {
          id: 48,
          name: '진주시'
        },
        {
          id: 49,
          name: '창녕군'
        },
        {
          id: 50,
          name: '창원 마산합포회원구'
        },
        {
          id: 51,
          name: '창원 의창성산구'
        },
        {
          id: 52,
          name: '창원 진해구'
        },
        {
          id: 53,
          name: '통영시'
        },
        {
          id: 54,
          name: '하동군'
        },
        {
          id: 55,
          name: '함안군'
        },
        {
          id: 56,
          name: '함양군'
        },
        {
          id: 57,
          name: '합천군'
        }
      ]
    },
    {
      id: 17,
      name: '제주특별자치도',
      towns: [
        {
          id: 155,
          name: '서귀포시'
        },
        {
          id: 156,
          name: '제주시'
        },
        {
          id: 157,
          name: '제주특별자치도'
        },
        {
          id: 237,
          name: '전체'
        }
      ]
    }
  ]
};

export { animalData, placeData };
